Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_7 Fates (KO>EN).tmx
Source language: ko
Languages: en

source: 음력 1월 16일 손님 오는 날이 부모님의···.
en: january 16th on the lunar calendar... the day of the visitors is my parents’...

source: [500m] 내 (3/99)명
en: (3/99) Hunters Within 500m Radius

source: 까불지마 저게 어딜 봐서 네 거야?
en: hey kid, how dare you call us thieves?

source: 다행히 저렴하게 무기를 얻었네.
en: lucky we bought the weapon at a good price.

source: 미식당
en: mi diner

source: ···살았···다.
en: phew... we’re alive.

source: ···도건아?
en: do-geon...?

source: 고마워, 덕분에 살았어.
en: thanks, you saved us.

source: 분명 이 녀석 심장을 꿰뚫었을···
en: I stabbed right into his hear--

source: 저 사람도 찾는 범이 있는 건가···.
en: looks like he’s chasing after a specific beom as well...

source: 살려주세요, 제발!{j}집에 아이가 기다리고 있어요···.
en: spare me, please! I have a child waiting back home...{j}

source: 정신 잃으면 안 돼!
en: stay with me!

source: 큭!
en: argh!

source: 어서 가자, 제하야!
en: let us go, zeha! hurry!

source: 키키키
en: keke

source: 아무도 내 말을 믿어주지 않아.
en: no one believes my words.

source: 나한테 범들을 막을 수 있는 힘이 있었다면···
en: if I had the power to stop the beom...

source: 그리고 그 비밀의 실마리는 인왕산에 있다는 것・・・!
en: and two is that the key to it must be in inwang mountain!

source: 이기적이고 위선적이죠.
en: but you’re also selfish and hypocritical.

source: 몸이 재생하고 있어?!
en: his body is regenerating!

source: 뭘 그리 놀라.
en: don’t be so surprised.

source: 네가 말하는 범은 오른쪽 눈에 흉터가 있지 않았나?
en: the beom you’re talking about, does he have a scar on his right eye?

source: 몸이 안 움직여···.
en: I can’t move...

source: 하루야, 괜찮아?!
en: haru, are you okay?

source: 건물이 붕괴되면 아무리 저 녀석이라도 무사하지 못할 거야.
en: bulti is strong, but he won’t live through a collapse.

source: 내가 가장 신뢰하고 의지했던 친구였어.
en: he was my most trusted and reliable friend.

source: 미친!
en: you horrible...!

source: 피해!
en: run!!!

source: 설마 네놈들이 있을 줄이야.
en: I didn’t expect you guys to be here.

source: 까드득
en: clench

source: 휘오오오오
en: da dun

source: 하루 너는 인간의 규칙과 규율을 좀 알아야 할 필요가···.
en: haru, you really need to learn how we humans work--

source: 으앗!
en: whoa!

source: 하지만 내가 결계를···.
en: but I broke the seal...

source: 슈르르・・・
en: whirl

source: 이 목소리・・・
en: this voice...

source: 네 이름은 뭐야?
en: what’s yours?

source: 촤르르
en: clank

source: 우선 흩어져서 사람들부터 구하자!
en: let us separate and save the people first!

source: 그 박물관··· 며칠 전까지만 해도 멀쩡한 곳이었어.
en: that museum... it was under operation until just a few days ago.

source: 한번 따라가 보자.
en: I must follow them.

source: 커흑···!
en: ack!!!

source: 상고 시대의 검.
en: the sword of the ancient age.

source: 못난 나를 용서해라.
en: forgive me for being a fool.

source: 상고시대 유물 전시
en: The Artifacts of The Ancient Age on Display

source: 이럴 시간 없다.{j}우선 데리고 나가자!
en: we do not have time for this. let us take him and escape!{j}

source: 시체까지 실종된 적은 없었습니다.
en: there’s never been an instance where the whole body went missing.

source: 해가 뜨기 전에 각자 맡은 구역을 끝낸다.
en: conquer the entrusted district before the sunrise.

source: 범을 사냥할 생각이었다면 이미 늦었네.
en: if you planned to hunt the beom, you are too late.

source: ···탄도 다 떨어졌고, 여기서 죽는 건가.
en: we’re out of ammo... this must be the end of us.

source: 빙글
en: twirl

source: 곰족 때문에 우리는 수없는 시간을 그림자 세계에 갇혀 지냈어.
en: we spent countless years in the world of shadows because of the gom tribe.

source: 계시려나아~
en: I wonder if he’s still there...

source: 범의 힘···?
en: the power of a beom...?

source: 소화전
en: fire hydrant

source: 렌즈를 안 껴서 잘 보이질 않네・・・.
en: I can’t see without my contact lenses...

source: 역시 신시를 대표하는 기업은 이살 그룹밖에 없습니다.
en: yisal group sure is the company representing the city!

source: 범이 한 거야.
en: the beom did it.

source: 꿀렁
en: squelch

source: 뭐, 뭐 하는 거야?
en: wh-what are you doing?

source: 못 보던 회사 같아서요.
en: I don’t recall seeing your company truck around here.

source: 저, 저희는 맛없을 거예요!
en: w-we won’t taste good at all!

source: 절뚝
en: limp

source: 뭐지?!{j}몸이 저절로 움직였어···.
en: what was that?! my body made the move before I could even think...{j}

source: 여기 봐!
en: look at me!

source: 정신 차려, 환!!!
en: get it together, hwan!!!

source: 괴로워.
en: it’s agonizing.

source: 제 7 화
en: Episode 7

source: 구구구구
en: kaboom

source: 서둘러야겠구나, 제하야.
en: we better hurry, zeha.

source: 뭐야, 이 자식!
en: what’s with this punk?

source: 평소와 다르게 귀찮게 구는군.
en: he’s unusually pesky today.

source: 그런 억지가···!
en: now you’re just being unreasonable!

source: 뭐야, 아저씨.
en: wow, mister.

source: 곰족 후손을 섬멸하라.
en: annihilate the descendants of the gom.

source: 오전 07:48
en: 07:48 AM

source: 제하가 사실 범이었다거나, 어떤 사건을 통해 범의 힘을 받은 게 아닐까?
en: ...he either has to be a beom or must’ve went through an experience that left him with the beom’s power.

source: 결국 최후에 웃는 건 우리일 테니까.
en: we’ll have the last laugh in the end.

source: 살고 싶다고?
en: you don’t want to die, huh?

source: 그리고 그런 범을 사냥하는 자들이 있었으니···
en: and among the people hunting down the beoms...

source: 반드시 여기서 저지해야 한다.
en: we must end him at all costs right here, right now.

source: 무슨 무도회 소품 같네.
en: it looks like a mask in a masquerade ball.

source: 뭐?!
en: what?!

source: 온갖 고문에도 죽지 않고 버티는 튼튼한 인간이라 했어요!
en: made it through all kinds of torture!

source: 토카레프
en: TOKAREV

source: 동생이랑 놀아주는 대회는 어디 없나~
en: I wish there was one that determines who plays with their younger sibling the best!

source: 버···범이다!
en: t-the beom are here!

source: 일 년에 딱 한 번 그림자 세계의 봉인을 열고 찾아온 범들이
en: once a year, the beoms break through the seal to the world of shadows.

source: 부아아
en: crackle

source: 가족을 잃는 사람도 없었을 거야.
en: ...or their families.

source: 이런, 아무래도 핸드폰을 두고 온 모양이야.
en: jeez, I must’ve left my phone back there.

source: 뭐 해?
en: aren’t you coming?

source: 겨··· 경수 형···.
en: k-kyungsoo...

source: 나도 놈을 찾고 있다.
en: I’m looking for him as well.

source: 몇 놈만 가지고 놀까?
en: shall we entertain ourselves with some of them first?

source: 어머니・・・아버지.
en: mom... dad...

source: 정말 떠오르지 않는 거냐.
en: do you really not remember?

source: 지이잉
en: slide

source: 이 사람들은 왜요?
en: why? who are they?

source: 왜 그렇게 인간들을 감싸는지 모르겠지만···
en: I don’t know why you’re trying so hard to stand on their side, but...

source: 인간···!{j}정신이 든 건가?!
en: human...! are you awake?!{j}

source: 세상을 어지럽히지.
en: ...and bring chaos to the world.

source: 지하에서 날 구해준 것 같은데 고맙단 인사도 늦었군.
en: I know this a bit late, but thank you for saving me back in the underground.

source: 피하기도 귀찮···
en: I’m too lazy to even dodge--

source: 훙
en: twirl

source: 정신 차려봐, 눈 떠!!
en: can you hear me? open your eyes!

source: 나한테도 처음에는 총을 겨눴지만,
en: he also pointed a gun at me the first time we met.

source: 이살 백화점에서 난데없는 총격전!
en: Unexpected gunshots took place at Yisal Department Store!

source: 무슨 소란이야?!
en: what’s this all about?!

source: 범 사냥꾼?
en: you two are beom hunters?

source: 당신들은 오만하고 불손한 데다,
en: not only are you humans insolent,

source: 콰콰콰콰
en: crash

source: 당신의 힘으론 벗어날 수 없어요.
en: you are not strong enough to escape.

source: 카가각
en: clang

source: 나비들?
en: the butterflies?

source: 쿠구구구
en: rumble

source: 무, 무슨 일이시죠···?
en: i-is something wrong...?

source: 불티···.
en: bulti...

source: 요즘 같은 시기니까 도둑놈이 더 많지.
en: for them, now is the perfect opportunity.

source: 그런 장소쯤 얼마든지 만들면 되니까.
en: I can make something like that anytime.

source: 내 이름은 하루.
en: my name is haru.

source: 욱씬
en: throb

source: 푹
en: stab

source: ···주안아.
en: jooan...

source: 그렇게 최초 목격자에게 발견된 나는 병원으로 이송된 모양이다.
en: apparently, I was rushed to the hospital after the first witness found me.

source: 쿠콰콰
en: dash

source: 느려 터졌군···.
en: this thing is ridiculously slow...

source: 시민들의 안전과 생활을 위해서라면 아깝지 않습니다.
en: for the safety of the people, every penny is worth it.

source: 이 녀석한테서 범 냄새가 난다.
en: this one reeks of beom.

source: 너희들도 잘 모르는 거 같으니 난 이만 가볼게.
en: I’ll get going now... I can see you don’t know much about him either.

source: 내 힘으로 당해낼 수 없는 인간을 만난 건 처음이다···!
en: I’ve never fought a human stronger than myself before...!

source: ···너 그냥 외로운 거 아냐?
en: are you sure you’re not just lonely?

source: 날 인왕산에 보낸 그 남자가 사건과 연관이 있는 건가 ・・・?
en: is the man who got me to go to the mountain related to the murders?

source: 저 기술은···!
en: that skill is...!

source: 도건까지 상대하는 건 리스크가 크다.
en: it’s risky to confront do-geon as well.

source: 터억
en: tap

source: 총기, 무기류 밀매
en: Arms Trafficking

source: 동생을 구할 수 있게 도와줘!
en: help me save my sister!

source: 이봐, 자후.{j}왜 그렇게 인간들을 감싸는지 모르겠지만···
en: listen, zahu. I don’t know why you’re trying so hard to stand on their side, but...{j}

source: 그래서 경태야, 걔들 아직도 못 찾았냐?
en: so kyeongtae, have you not found them yet?

source: 난 마로 형보다 친절하니까.
en: I’m just that nicer than maro.

source: 푸슈우우
en: whoosh

source: 너 시간 좀 있냐?
en: are you free right now?

source: 구오오오
en: da dun

source: 숨지 말고 나와!
en: stop hiding and show yourself!!!

source: 아아아아아
en: ahhhh

source: 스으으으으
en: crack

source: 이봐, 자후.{j}그대로 굶어 죽을 셈이야?
en: hey, zahu. are you trying to starve yourself to death?{j}

source: 분하다・・・.
en: I’m so angry...

source: 뒤적
en: rummage

source: 착각하지 마.{j}용서하겠다는 건 아니야.
en: don’t get me wrong, though. I’m not saying I forgive you.{j}

source: 꽈드득
en: crack

source: 범 사냥으로 일
en: People become professional beom hunters

source: 한국은행총재
en: Bank of Korea Governor

source: 로고
en: logo

source: 의심은 곧 원망으로 바뀌었다.
en: soon, that thought turned to resentment.

source: 하지만 고민할 것도 없는 문제였다.
en: the answer was obvious.

source: 건물이···.
en: the building...

source: 콜록
en: cough

source: 부모님이 날 버린게 아닐까?
en: I thought my parents abandoned me.

source: 그는 범으로부터 주민들을 지킨 영웅이야.
en: he was the hero who protected everyone from beom.

source: _x0008_떡볶이
en: Tteokbokki

source: 불티를 네가 어떻게 알고 있지?
en: how do you know bulti?

source: 괜찮아, 꼬마야.
en: don’t worry, kiddo.

source: 하루!{j}괜찮아?
en: haru! are you all right?{j}

source: 여자애?
en: a girl?

source: 뭐든지 할게요!
en: I’ll do anything you want!

source: 젠장!{j}아직도 이렇게나···!
en: this is not good. there are still plenty of them around!{j}

source: 나・・・한테 참 잘해・・・주셨어.
en: he... was really nice to me.

source: 조금 쓸 만한 건 4~5억이 넘으니···.
en: the good ones go well over 400 to 500 million won*... *about 335,200 USD and 419,000 USD respectively.

source: 나한테 이런 힘이 있었나?
en: since when did I have such power...?

source: 나랑 닮았거든···.
en: yes. she looks like me...

source: 이런 짓은 그만하는 게···
en: it is best to stop this kind of--

source: 터업
en: plop

source: 믿기 어려울 거야.
en: I know it’s hard to believe.

source: 살아 있다면 언젠가 또 만나자고.
en: till we meet again... if all of us stay alive, that is.

source: 그걸 쓰면 당신들 빼곤 다 죽는다고!
en: everyone here except for the two of you will die!

source: 사람들은 이 사건을 벌이는 존재를 이렇게 부르기 시작했다.
en: ...people began to call the entity responsible for the murders...

source: 피해자 J 씨는 XX병원에 입원 중
en: The gunshot victim is receiving treatment in a hospital

source: 킁킁
en: sniff

source: 도건 그 자식이랑도 엮이지 않았을 테고···.
en: and I sure wouldn’t have had to deal with do-geon.

source: 쳇, 굴욕이다.
en: tsk, it’s so shameful that

source: 이상해.
en: weird.

source: 다들 이쪽으로 오세요!
en: this way, everyone!

source: ···살고 싶어!
en: I want to live...!

source: 오빠, 오늘도 연습 가?
en: another day of practice, hwan?

source: 움직이면 저 자식 진짜로 죽어.
en: you better not move if you don’t want him to die.

source: 쿠에엑!!
en: argh!!!

source: ···난 눈앞에서 범이 부모님을 죽이는 걸 봤어.
en: my parents were murdered by a beom before my very eyes.

source: 알았어.
en: all right.

source: 츠즈즈
en: bzzt

source: 이거 위험한데?
en: this is bad...

source: 진짜로 저게 필요한 거 맞아?{j}저거 훔치다가 걸리면 우린 범죄자가 된다고!
en: are you sure that’s the one? we’ll end up behind bars if we get caught stealing it!{j}

source: 실종자 1,450명.
en: 1,450 went missing.

source: 네놈들, 멋대로 먹잇감을 풀어준 대가는 비싸게 칠 거다.
en: I’ll make you punks pay double for freeing my preys behind my back.

source: 그런데 이 청년은 누구?
en: if I may ask, who is this young man?

source: 짹
en: chirp

source: 형님, 저 사람들이 시민들을 구해줬나 봐요.
en: they must’ve saved the people in the rubble.

source: 카가가가각
en: screech

source: 나, 강해지고 싶어.
en: I want to get stronger.

source: 이 개자식!
en: you bastard!

source: 호랑나비 본부
en: tiger butterfly headquarters

source: 아직 인간이 더 남아 있었나.
en: I didn’t know there were still humans here.

source: 내가 잘 먹어주마.
en: I’ll simply enjoy my meal.

source: 그렇다면 왜 네가 있는데
en: if that’s who you are,

source: 이런 날, 수상쩍은 사내가 찾아와,
en: is it a coincidence that a strange man appeared on that very date...

source: 푸쉬이이
en: whoosh

source: 꾸드드득
en: wriggle

source: 저들은 먹이가 아니라 함께 살 수 있는 자들이야.
en: they are not your food but people who can co-exist with us.

source: 에이씨, 어쩐지 꿈자리가 더럽더라니···!
en: oh, rats! I knew last night’s dream meant bad luck!

source: 따뜻한 솔길을 건내며 슬픔을 달래줄 사람도 없었기에
en: since no one was there to comfort me...

source: ···하루?
en: haru...?

source: 늦으면 혼나는 건 우리라고.
en: we’re the ones who’ll get the blame if you’re late.

source: 너는 죽는 편이 낫겠구나.
en: I’d better kill you.

source: 경태야, 지금 당장 팀원들 소집해.
en: kyeongtae, assemble the team immediately.

source: _x0008_EF-8563
en: EF-8563

source: ···음?
en: huh...?

source: 크윽!
en: ugh!

source: 신시를 놓고 벌인 전쟁은 아주 오랫동안 이어졌지만,
en: the war over shin-si continued for a very long time...

source: ···여긴 백화점이잖아?
en: a... department store?

source: 애들 챙겨.{j}물러간다.
en: gather them all up. we’re leaving.{j}

source: 정말 여기로 가는 게 맞아?
en: are you sure this is the right way?

source: 그는 검고 예리한 검으로 범들을 베어 나갔지만···
en: he went on to slay the beom with his dark and sharp sword, but...

source: 설마, 네 녀석···
en: no way...

source: 그러던 어느 날, 인왕산에서 끔찍한 살인이 일어났고
en: then one day, a heinous murder took place at inwang mountain.

source: 제 5 화
en: Episode 5

source: 스르르륵
en: fade

source: 야, 먹을 때는 좀 깔끔하게···.
en: hey, learn some table manners--

source: 얘들아, 잠깐 내 얘기 좀 들어줄래?
en: hey, could all of you hear me out for a second?

source: 예나 지금이나 변한 게 없어서 안심이네.
en: I’m glad you’re all the same as ever.

source: 우리한테 사기 치려고 했던 거야?
en: were you trying to swindle us? is that it?

source: 그렇게 사람들의 전생을 보던 중
en: it was another day of observing people...

source: 형님!
en: seongjin!!

source: 철그럭
en: ka-chunk

source: 키키
en: keke

source: 이게 무슨 소리지?
en: what’s that noise?

source: 오시게.
en: come,

source: 그러니까···
en: so...

source: 오늘은 같이 놀 수 있을 줄 알았는데···!
en: I thought I’d finally get to play with you today...!

source: 저건 우리 것이다.
en: that sword belongs to us.

source: 범 한 마리 목에 걸린 현상금은 5천만 원.
en: the bounty on each beom’s head is 50 million won*. *about 41,900 USD.

source: 제일 성가셔 보이는 놈은 처리했고,
en: that takes out the peskiest one...

source: 우리라도 요기를 해야겠어.
en: ...we’ll help ourselves to some snacks.

source: 젠장, 이래선 물건 회수도 안 될 것 같은데?
en: this is bad. we won’t be able to retrieve the cash.

source: 쫑긋
en: glance

source: 그렇게 넌, 범족인 아비와 인간···
en: and with that, you were born to your beom father and human mother...

source: 동감.
en: Agreed.

source: 기억나니?
en: the gate game song.

source: 이게...범 인가?!
en: so this is what a beom is like...!!

source: 정말 알고 싶으냐?
en: do you really wish to know?

source: 환!
en: hwan!

source: 번뜩
en: jolt

source: 저릿
en: throb

source: 제하야, 너 이미 몸이・・・!
en: zeha, but you’re already...!

source: 투콰콰쾅
en: boom

source: 제가 처리할 테니 잠시만 기다려 주십시오.
en: I’ll take care of it, so please wait here a little.

source: 범의 세계로 이어진 통로를 열 수 있었지.
en: ...to open the passageway to the world of beoms.

source: 꾸우욱
en: jostle

source: 뭐든···.
en: anything...

source: 들어줘서 고맙다.
en: thanks for understanding.

source: 제하야, 거기서 떨어져!
en: zeha, step away from it!

source: 이것 봐, 하루야···.
en: do you see this, haru?

source: 그야, 나는 이 곳에 남아 범들에게서 세상을 수호하는 위대하신・・・
en: it’s no surprise as I am the great deity who remained here to protect this world from the beoms--

source: 파란색 원피스를 입은···.
en: and is wearing a blue dress.

source: 여긴 네 명이 들어오기엔 좀 좁지 않나?
en: isn’t this place a bit too small for four people?

source: 오시게・・・오시게.
en: come... come.

source: 살해당한 피해자는 24명.
en: all 24 victims...

source: 후우우...
en: whoosh

source: 고마…
en: thank...

source: 덜컹
en: rattle

source: 아무래도 뭔가 오해를 산 모양이네.
en: but I’ve only caused a misunderstanding.

source: 레스
en: Express Inc.

source: 너, 언제까지 같이 있을 거야?
en: do-geon, how long do you plan to stay with us?

source: 싸움은 젬병인가 해서.
en: I assumed you suck at combat.

source: 정신이 드느냐?
en: how do you feel?

source: 갑자기 공격이라니.
en: such an abrupt attack...

source: ···물.
en: water...

source: 뭐, 뭐야?!
en: wh-what the...?!

source: 호랑나비 팀 말이야.{j}범 사냥꾼이 생겨난 직후 곧장 세력을 확장한 팀 중 하나잖아.
en: I mean the tiger butterfly. it’s one of the teams that expanded influence right after the emergence of beom hunters.{j}

source: 인간들 틈에 섞여
en: they blend in with humans...

source: 저놈의 머리뼈는 못 뚫는 건가.
en: but looks like they can’t pierce his skull.

source: 무례하군요.
en: how rude.

source: 실적을 올릴 기회다!
en: it’s time to score big!

source: ···이 양반, 많이 취했구먼.
en: you must’ve had one too many.

source: 저 아저씨가 사기를 치려고 했다는데?
en: they’re saying the vendor over there tried to swindle them or something.

source: 놈은 어디에 있지?
en: where is he?

source: 다시 여기에 오게 될 줄이야.
en: who would’ve thought I’d come back here...

source: 나는 도건.
en: ...but I’m do-geon.

source: 남은 건 세 놈인가.
en: ...so I’m left with three more to go.

source: 이살 백화점 지하.
en: at the basement of yisal department store.

source: 너 뭐 하는 녀석이냐.
en: what are you?

source: 덜컥
en: swing

source: ···일단은 놈이 원하는 대로 해주자.
en: let’s just play along for now.

source: 놈들도 범이라는 괴물인가!
en: they must be beom, too!

source: 산 인간을 트럭에 싣는 범들을 봤어.
en: ...loading live humans into a truck instead of devouring them on the spot.

source: 아직 견딜만한가 보군, 자후.
en: guess you didn’t reach your limit yet, zahu.

source: 나는 이곳에 앉아 모든 걸 지켜보았지.
en: I was here when it all happened.

source: 저는 단지 당신들에게 제안을 하러 왔을 뿐.
en: I am simply here to make you an offer.

source: 파악
en: crack

source: 박식당
en: PARK’S DINER

source: 다음 날 일어날 호환에 휘말리지 않았을 텐데.
en: she wouldn’t have been kidnapped by the beom the very next day.

source: 그리고 이곳의 평화를 약속한 또 하나의 수호자.
en: there was another guardian who vowed to keep the peace of the land as well.

source: 그런 너를 어떻게 탓할 수 있겠어.
en: how could I ever blame such a person?

source: 자···잠깐!{j}너 이 자식!
en: h-hold it, you ignorant fool!{j}

source: 이런 시간에 나 말고 사람이 더 있을 줄은 몰랐네.
en: I didn’t expect anyone else to be here at this hour.

source: 이건 우리가 먼저 사냥 중이던 범들이다.
en: we’ve been hunting these beom before you have,

source: 공동기획 · 하이브 / 네이버 웹툰
en: Joint Planning · HYBE & Naver Webtoon

source: 지금 우리가 범과 싸우는 것 또한
en: could it be that the workings of the past life...

source: 말이 그렇다는 게야.
en: I am just expressing my thought.

source: 아빠···.
en: dad...

source: 아니,
en: no way.

source: 뻐억
en: wham

source: 이살백화점
en: Yisal Department Store

source: 쓸데 없는 소릴···.
en: you didn’t have to say that out loud...

source: 찾았다.
en: found him...

source: 쏴아아
en: swaaa

source: [단독] 실추된 호랑나비의 명성.
en: [Exclusive] The Tanked Reputation of the Tiger Butterfly

source: 흔들
en: swing

source: 미끼 역할 확실한데!
en: he really made things easy for us!

source: 분명 그저께까지 상처가 있었는데···.
en: there was a wound just two days ago, but now...

source: 환웅이 범 포획 작전에 현상금을 부여하면서 생계형 범 사냥꾼들이 많아지기 시작했다.
en: ever since hwanwoong announced to reward those who hunt the beom, more and more people became full-time beom hunters.

source: 수많은 범과 동생을 데려간 그 녀석···
en: ...where numerous beom were, along with the one who took my sister...

source: 날 앞에 두고 남 걱정이라니.
en: worrying about the others when I’m standing right here, huh?

source: 촤아아악
en: splat

source: 항상 정의로워야 한다 이 말이지.
en: that means we should always act in justice.

source: 치이이이익
en: sizzle

source: 제기랄!
en: this can’t be happening!

source: 당하고만 있는 건 성미에 맞지 않아.
en: taking something like this lying down is way out of character for me.

source: 탄이 바닥난 모양이군!
en: looks like you’re out of ammo!

source: 용서하겠다는 건 아니야.
en: I haven’t forgiven you yet.

source: 무한포차
en: MUHAN BAR

source: 우리는 모두 범에게 소중한 것들을 잃은 사람이잖아.
en: all of us here lost the people we love to the beom.

source: 한 마리도 안 먹었네?
en: why haven’t you eaten any of them yet?

source: 미안해···.
en: I’m really sorry...

source: 다른 세계에서 손님이 온단다.
en: visitors from another world enter our own.

source: 끄헤헤헤헤헤!
en: hehehehe!

source: 뒤 조심해!
en: behind you!

source: 두근
en: thump

source: 놈들만 아니었어도···!
en: if it weren’t for them...!

source: 검이!
en: not now!

source: 이번 일만 잘 해결된다면, 동철 형님도 날 다시 보실 거야!
en: once I take care of this job, dongcheol will see me differently!

source: 얘들아.
en: everyone.

source: 아직 의식이 완전히 돌아온 게 아닌가?
en: I suppose his consciousness has not fully returned.

source: 7구역 사거리
en: District 7 Intersection

source: 그런데···
en: with that said...

source: 나도 척살검을 통해서 본 것 같아!
en: ...is what I saw through the sword of death!

source: 츠츠츠
en: bzzt

source: ··· 어째서 이런 일이.
en: why did this happen?

source: 말을 돌렸어?!
en: he changed the subject!

source: 하이브/네이버웹툰
en: HYBE & Naver Webtoon

source: 후포인가?
en: is it hupo?

source: 콰아아
en: zoom

source: 여긴 불이 켜져 있네.
en: ah, the light’s still on in that room.

source: 이 기운은···.
en: this is...

source: 여기도 5분이면 전부 붕괴되겠지.
en: there’s only about five minutes left until this place collapses...

source: 그럼, 잘 가라.
en: so long, then.

source: 뭐야, 이 움직임!
en: look at its moves!

source: 모든 감각이 손끝에서 전해진다.
en: all of my senses are concentrated on my fingertips.

source: 아하하하!{j}저 반푼이.
en: hahahaha! what a fool.{j}

source: 호랑나미 총대장 동철
en: commander of the tiger butterfly dongcheol

source: 내가 할 수 있는 건 '기억이 나지 않는다'라는 대답뿐이었다.
en: but the only answer I could give him was that I didn’t remember.

source: 아직도 남아 있는 인간이 있었어?
en: I didn’t know there were still humans here.

source: 콰드드드드
en: crackle

source: 가자, 시간이 얼마 남지 않았다.
en: let’s go. we don’t have much time left.

source: 알겠어, 가자.
en: okay, let’s go.

source: 왜 그렇게 고통을 자처하지?
en: why do you insist on causing yourself more pain?

source: 우리가··· 아니, 네가 갖고 싶다고 해서 다 우리 것인 게 아니야.
en: uhm, not everything that we want, no, you want is ours.

source: 이걸로 사람들의 전생을 볼 수 있는 건가?
en: I can see people’s past lives with this.

source: 콰각
en: crack

source: 공동기획:
en: Joint Planning:

source: 어서 한 놈이라도 잡아먹어서 에너지를···!
en: I gotta eat and restore some energy...!

source: 띠링
en: ring

source: 구매 문의
en: For purchase, call:

source: 잘 떠올려 보렴, 제하야.
en: think, zeha.

source: 역시···
en: just as I thought...

source: 이럴 수가···!
en: oh, please...

source: 호흡을 가다듬고 범들을 찬찬히 봐.
en: take a deep breath and look closely.

source: 슈우우
en: swoosh

source: 도망쳐!
en: zeha!

source: 미안.
en: I’m sorry.

source: 나도 나름 거래를 해봐서 아는데, 근접 무기는 잘 쳐야 5억이잖아.
en: I’ve traded weapons myself. melee weapons cost 500 million won* at best. *approximately 410,000 usd.

source: 어떻게 저런 낡은 검으로···!
en: how did he do that with such a crusty old sword...?!

source: 여기서 그걸 쓰실 생각입니까!
en: you can’t possibly use that here!

source: 경찰은 부검을 통해 범의 소행일 가능성이 높다고 발표했습니다.
en: the police reported that according to the autopsy, beoms are the primary suspects.

source: 함께 어우러져 살아갈 수도 있는···
en: we could always live together in harmony--

source: 동성
en: dongseong

source: 저분들이 있으면 안심이지.
en: I’m so relieved they’re here!

source: 범은 정말이지 강했다.
en: the beom was extremely powerful.

source: 파츠츠
en: bzzz

source: 괴물인 건 오히려 그쪽 아닌가요?
en: rather, aren’t you more of a monster?

source: 난 제법 친절하거든.
en: I’m just that kind.

source: 티잉
en: crack

source: 군침이 돌지 않나, 자후.
en: isn’t he just mouthwatering, zahu?

source: ···뭔가 있다?
en: something’s there.

source: 우우웅-
en: rumble

source: 우리도 해가 지기 전에 가자꾸나.
en: we should also hurry along before the sun sets.

source: 여긴 어디야!{j}꺼내줘!
en: where am I?! let me out of here!{j}

source: 덜덜
en: tremble

source: 벌떡
en: jolt

source: 타앙
en: bang

source: 싫으면 사지 마.
en: if you don’t like it, don’t buy it.

source: 카가가각
en: screech

source: 난 그녀의 복수를 하기 위해 불티를 찾고 있어.
en: I’m searching for him to seek my revenge for her.

source: 젠장!
en: this is not good.

source: 어째서인지 괴로운 듯 보였다.
en: ...he looked agonized for some reason.

source: 우리 힘을 합치면 쓰러뜨릴 수 있을 거야···!
en: he’ll breathe his last if we fight together...!

source: 세 달 후
en: three months later

source: 슈아아악
en: stab

source: 나는···
en: I...

source: 나를 달래며, 그리움이 무뎌져 사라지기만을 참고 기다렸다.
en: whenever that happened, I patted myself on the back and endured until the terrible sense of loneliness died away.

source: 범
en: ...was beom.

source: 저게 뭐야···.
en: what in the world...?

source: 제 딴에 미안한 마음을 표현한 거야.
en: that’s his way of apologizing.
